In [1]:
import pandas as pd
import numpy as np
a2d=np.array([[10,20,30],[40,50,60],[70,80,90]])
a2d

array([[10, 20, 30],
       [40, 50, 60],
       [70, 80, 90]])

In [5]:
from pandas import Series,DataFrame
df=DataFrame(a2d,index=['x','y','z'],columns=['a','b','c'])
df

    a   b   c
x  10  20  30
y  40  50  60
z  70  80  90

In [6]:
df['b']

x    20
y    50
z    80
Name: b, dtype: int32

In [8]:
df[['a','b']]

    a   b
x  10  20
y  40  50
z  70  80

In [9]:
df.loc['x']

a    10
b    20
c    30
Name: x, dtype: int32

In [10]:
df.iloc[1]

a    40
b    50
c    60
Name: y, dtype: int32

In [12]:
df['x':'y']

    a   b   c
x  10  20  30
y  40  50  60

In [13]:
#recupere la colonne
df.a

x    10
y    40
z    70
Name: a, dtype: int32

In [14]:
df['a']

x    10
y    40
z    70
Name: a, dtype: int32

In [29]:
df1=DataFrame({'Produit_Id':[23,96,97,15,87],'Name':['computer','python','course','banana','sandwich'],
               'Whole_Sale_Price':[500,35,35,0.5,3],'Retail_Price':[1000,75,75,1,5],'Sales':[100,1000,500,200,300]})
df1

   Produit_Id      Name  Whole_Sale_Price  Retail_Price  Sales
0          23  computer             500.0          1000    100
1          96    python              35.0            75   1000
2          97    course              35.0            75    500
3          15    banana               0.5             1    200
4          87  sandwich               3.0             5    300

In [39]:
#Claculer le revenu de chaque Produit
df2=((df1.Retail_Price-df1.Whole_Sale_Price)*df1.Sales)
df2

0    50000.0
1    40000.0
2    20000.0
3      100.0
4      600.0
dtype: float64

In [40]:
df2.sum()

110700.0

In [48]:
df1['Retail_Price']== 2*df1['Whole_Sale_Price']

0     True
1    False
2    False
3     True
4    False
dtype: bool

In [51]:
df1[df1['Retail_Price']>=2 *df1['Whole_Sale_Price']]

   Produit_Id      Name  Whole_Sale_Price  Retail_Price  Sales
0          23  computer             500.0          1000    100
1          96    python              35.0            75   1000
2          97    course              35.0            75    500
3          15    banana               0.5             1    200

In [98]:
df1['Current_net']=df1.Retail_Price - df1.Whole_Sale_Price
df1

   Produit_Id      Name  Whole_Sale_Price  Retail_Price  Sales  Current_net
0          23  computer             500.0          1000    100        500.0
1          96    python              35.0            75   1000         40.0
2          97    course              35.0            75    500         40.0
3          15    banana               0.5             1    200          0.5
4          87  sandwich               3.0             5    300          2.0

In [99]:
df1['After 15%']=df1.Current_net*0.85
df1

,Produit_Id,Name,Whole_Sale_Price,Retail_Price,Sales,Current_net,After 15%
0,23,computer,500.0,1000,100,500.0,425.000
1,96,python,35.0,75,1000,40.0,34.000
2,97,course,35.0,75,500,40.0,34.000
3,15,banana,0.5,1,200,0.5,0.425
4,87,sandwich,3.0,5,300,2.0,1.700

In [60]:
((df1.Retail_Price - df1.Whole_Sale_Price) * df1.Sales).loc[0]

50000.0

In [62]:
((df1.Retail_Price - df1.Whole_Sale_Price) *df1.Sales).loc[1:2].sum()

60000.0

In [63]:
((df1.Retail_Price - df1.Whole_Sale_Price) *df1.Sales).loc[3:4].sum()

700.0

In [68]:
Revenue_Total=((df1.Retail_Price - df1.Whole_Sale_Price)*df1.Sales).sum()
Revenue_Total

110700.0

In [76]:
 reduction=((df1.Retail_Price - df1.Whole_Sale_Price)* df1.Sales).sum()*0.3
reduction

33210.0

In [94]:
df=DataFrame({'a':[30,40,50,60],'b':[80,70,50,40]}, index=['x','y','z','u'])
df

    a   b
x  30  80
y  40  70
z  50  50
u  60  40

In [95]:
df['r']=[40,50,60,90]
df

    a   b   r
x  30  80  40
y  40  70  50
z  50  50  60
u  60  40  90

In [96]:
df['w']=df.a+df.b
df

    a   b   r    w
x  30  80  40  110
y  40  70  50  110
z  50  50  60  100
u  60  40  90  100